#+TITLE: Chapter 2 - From Mathematics to Generic Programming
#+AUTHOR: Johnnie Walker

** 2.1 Egyptian Multiplication

#+BEGIN_SRC C++
  #include <iostream>

  int multiply0(int n, int a) {
    if (n == 1) return a;
    return multiply0(n - 1, a) + a;
  }

  int main() {
    // Test cases
    std::cout << "3 x 4 = " << multiply0(3, 4) << std::endl;
    std::cout << "5 x 2 = " << multiply0(5, 2) << std::endl;
    return 0;
  }
#+END_SRC

#+RESULTS:
| 3 | x | 4 | = | 12 |
| 5 | x | 2 | = | 10 |
